/*
 *  x264Encoder.c
 *  x264Encoder
 *
 *  Created by Takashi Mochizuki on 07/02/18. (mochi at da2.so-net.ne.jp)
 *  Copyright 2007-2010 MyCometG3. All rights reserved.
 *

This file is part of x264Encoder.

    x264Encoder is free software; you can redistribute it and/or modify
    it under the terms of the GNU General Public License as published by
    the Free Software Foundation; either version 2 of the License, or
    (at your option) any later version.

    x264Encoder is distributed in the hope that it will be useful,
    but WITHOUT ANY WARRANTY; without even the implied warranty of
    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
    GNU General Public License for more details.

    You should have received a copy of the GNU General Public License
    along with x264Encoder; if not, write to the Free Software
    Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

 */

#include "x264EncoderVersion.h"
#include "x264EncoderUtil.h"

#define kNibName "Settings"
#define kMaxSourceFrame 128			/* So much encoder delay... */
#define kBundleIdentifier "com.MyCometG3.x264Encoder"
#define kDispatchFile "x264EncoderDispatch.h"
#define kCodecID CODEC_ID_H264
#define kCodec_FormatType "avc1"	/* not 'avc1' but "avc1" here */
#define kCodec_cType 'avc1'			/* OSType */
#define kExtraDataTag 'avcC'		/* MPEG4=esds, x264=avcC */
#define REMOVELOG 1					/* Should be 1 */
#define WRITELOG 0					/* MPEG4=1, x264=0, xvid=1 */
#define MPEG4	0					/* MPEG4=1, x264=0, xvid=0 */
#define XVID	0					/* MPEG4=0, x264=0, xvid=1 */
#define TESTVFR 1					/* MPEG4=0, x264=1, xvid=0 */ /* test vfr (variable frame rate) support */
#define X264	1					/* MPEG4=0, x264=1, xvid=0 */
#define NATIVERECT 0				/* default u/v plane does not have correct alignment */
#define USECoreVF 1					/* CoreVF Framework support */
#define STRICTFLAG 0				/* Use strict flags on each samples */

#define REV_ENDIAN_BIG	1			/* params struct version; 0:NativeEndian, positive:BigEndian */
#define REV_PSYRD 2					/* params struct version; with psyrd, and without FLAG2_TRELLIS_QUANT */
#define REV_MAXQDIFF 3				/* params struct version; with MAXQDIFF and CHROMAOFFSET */
#define REV_COREVF 4				/* params struct version; with CoreVF framework support; 1.0.0 */
#define REV_SUBSAMPLE 5				/* params struct version; chroma subsampling mode support; 1.0.1 */
#define REV_X264PROFILE 6			/* params struct version; new x264 profile support; 1.1.0 */
#define REV_MBTREE 7				/* params struct version; new x264 mbtree support; 1.1.2 */
#define REV_WEIGHTP 8				/* params struct version; with weightp; 1.1.8 */
#define REV_FLAG2_MBTREE 9			/* params struct version; libav20774 support FLAG2_MBTREE natively; 1.1.10 */
#define REV_INTERLACED 10			/* params struct version; interlaced,lossless,aspect,cleanaperture; 1.2.0 */
#define REV_FLAG2_PSY 11			/* params struct version; libav22670 supports FLAG2_PSY, FLAG2_SSIM natively; 1.2.3 */
#define REV_LEVELFREE 12			/* params struct version; support all h.264 level value; 1.2.7 */
#define REV_IGNOREQSLIDER 13		/* params struct version; user can ignore quality slider; 1.2.8 */
#define REV_FAKEINTERLACED 14		/* params struct version; new --fake-interlaced support; 1.2.9 */
#define REV_X264OPENGOP 15			/* params struct version; support open gop; 1.2.13 */

#define X264PROFILE_UNDEF	0
#define	X264PROFILE_BASE	1
#define	X264PROFILE_MAIN	2
#define	X264PROFILE_HIGH	3

#define	X264PRESET_ULTRAFAST	-3
#define	X264PRESET_SUPERFAST	-5
#define	X264PRESET_VERYFAST	-2
#define	X264PRESET_FASTER	-4
#define	X264PRESET_FAST		-1
#define	X264PRESET_MEDIUM	0
#define	X264PRESET_SLOW		1
#define	X264PRESET_SLOWER	2
#define	X264PRESET_VERYSLOW	4
#define	X264PRESET_PLACEBO	3

#define X264TUNE_UNDEF	0
#define	X264TUNE_FILM	1
#define	X264TUNE_ANIMATION	2
#define	X264TUNE_GRAIN	3
#define	X264TUNE_STILLIMAGE	9
#define	X264TUNE_PSNR	4
#define	X264TUNE_SSIM	5
#define	X264TUNE_TOUHOU	6
#define X264TUNE_FASTDECODE 7
#define X264TUNE_ZEROLATENCY 8

#pragma mark -
#pragma mark Struct definitions


typedef struct {
	// 
	Boolean LOG_INFO;
	Boolean LOG_DEBUG;
	Boolean LOG_STATS;
	Boolean REV_STRUCT;				// 0:native-endian, 1:big-endian, 2:(0.9.0~).
	
	// codec context flag store
	Boolean reserved0x0001;
	Boolean FLAG_QSCALE;			// 0x0002
	Boolean FLAG_4MV;				// 0x0004
	Boolean reserved0x0008;
	Boolean FLAG_QPEL;				// 0x0010
	Boolean FLAG_GMC;				// 0x0020
	Boolean FLAG_MV0;				// 0x0040
	Boolean FLAG_PART;				// 0x0080
	Boolean reserved0x0100;
	Boolean reserved0x0200;
	Boolean reserved0x0400;
	Boolean FLAG_LOOP_FILTER;		// 0x0800
	Boolean reserved0x1000;
	Boolean reserved0x2000;
	Boolean reserved0x4000;
	Boolean FLAG_PSNR;				// 0x8000
	Boolean reserved0x00010000;
	Boolean FLAG_NORMALIZE_AQP;		// 0x00020000
	Boolean FLAG_INTERLACED_DCT;	// 0x00040000;
	Boolean reserved0x00080000;
	Boolean reserved0x00100000;
	Boolean reserved0x00200000;
	Boolean reserved0x00400000;
	Boolean reserved0x00800000;
	Boolean FLAG_AC_PRED;			// 0x01000000
	Boolean reserved0x02000000;
	Boolean FLAG_CBP_RD;			// 0x04000000
	Boolean FLAG_QP_RD;				// 0x08000000
	Boolean reserved0x10000000;
	Boolean reserved0x20000000;
	Boolean reserved0x40000000;
	Boolean FLAG_CLOSED_GOP;		// 0x80000000
	
	char NATIVE_FPS;				// 1:NTSC, 2:PAL, 3:FILM, 11:N/2, 12:P/2, 13:F/2, 21:Nx2, 22:Px2, 23:Fx2
	char MB_DECISION;				// 1:FF_MB_DECISION_SIMPLE, 2:FF_MB_DECISION_BITS, 3:FF_MB_DECISION_RD
	char RC_QSQUISH;				// 0-> clipping, 1-> use a nice continous function to limit qscale wthin qmin/qmax
	char MPEG_QUANT;				// 0-> h263 quant 1-> mpeg quant.
	char THREADS;					// Thread count. 1:single, 2:dual, 3:quad, 4:octa, 9:auto.
	char GAMMA;						// 0:DontAddGamma, 1:Gamma2.2
	char NCLC;						// 1:DontAddNCLC, 3:616, 4:516, 5:677, 6:111, 7:222
	char ME_METHOD;					// 1:EPZS, 2:HEX, 3:UMH, 4:FULL, 5:X1, 6:TESA
	
	int SC_THRESHOLD;				// limited to (-75K, 75K) 
	int QCOMPRESS;					// limited to (50, 80) as (0.50, 0.80)
	int NOISE_REDUCTION;			// limited to (0, 1000)
	int RC_MAXRATE;					// limited to (0, 245760); Kbps
		
	char REFS;						// limited to (1, 13); default 1
	char ME_RANGE;					// limited to (4, 64); default 16
	char MAX_BFRAMES;				// limited to (1, 13); default 1
	char CODER_TYPE;				// 1:CAVLC, 2:CABAC
	char DIRECTPRED;				// 1:Disabled, 2:Spatial, 3:Temporal, 4:Auto
	char CRF;						// 0:Normal, 1:ConstantRateFactor
	char ADAPTIVE_BFRAME;			// 0:Normal, 1:B_ADAPT_FAST, 2:B_ADAPT_TRELLIS
	char ME_SUBQ;					// limited to (0, 10); subpel quality
	
	char TRELLIS;					// 1:Disabled, 2:FinalOnly, 3:All; default 1
	char TURBO;						// 1:Disabled, 2:Turbo 1, 3:Turbo 2
	char CHROMA_ME;					// 0:OFF, 1:ON; default 1
	char PART_4X4;					// 0:OFF, 1:partition=all; default 0
	char BIDIR_ME;					// 0:OFF, 1:ON; default 0
	char USE3RDPASS;				// 0:OFF, 1:ON; default 0
	char LEVEL;						// 9->auto, 13->1.3, 21->2.1, 30->3.0, 31->3.1, 41->4.1, 51->5.1
	char EMBEDUUID;					// 0:OFF, 1:ON
	
	// codec context flag2 store
	Boolean reserved20x0001;
	Boolean reserved20x0002;
	Boolean reserved20x0004;
	Boolean reserved20x0008;
	Boolean FLAG2_BPYRAMID;			// 0x0010
	Boolean FLAG2_WPRED;			// 0x0020
	Boolean FLAG2_MIXED_REFS;		// 0x0040
	Boolean FLAG2_8X8DCT;			// 0x0080
	Boolean FLAG2_FASTPSKIP;		// 0x0100
	Boolean FLAG2_AUD;				// 0x0200
	Boolean FLAG2_BRDO;				// 0x0400
	Boolean reserved20x0800;
	Boolean reserved20x1000;
	Boolean reserved20x2000;
	Boolean reserved20x4000;
	Boolean reserved20x8000;
	Boolean reserved20x00010000;
	Boolean reserved20x00020000;
	Boolean FLAG2_MBTREE;			// 0x00040000
	Boolean FLAG2_PSY;				// 0x00080000;
	Boolean FLAG2_SSIM;				// 0x00100000;
	Boolean reserved20x00200000;
	Boolean reserved20x00400000;
	Boolean reserved20x00800000;
	Boolean reserved20x01000000;
	Boolean reserved20x02000000;
	Boolean reserved20x04000000;
	Boolean reserved20x08000000;
	Boolean reserved20x10000000;
	Boolean reserved20x20000000;
	Boolean reserved20x40000000;
	Boolean reserved20x80000000;
	
	int RC_BUFSIZE;					// limited to (0, 245760); Kbit
	int AQ_STRENGTH;				// limited to (50, 150) as (0.5, 1.5); default 100
	int PSYRD_RDO;					// limited to (0, 100) as (0.0, 10.0); default 10
	int PSYRD_TRELLIS;				// limited to (0, 100) as (0.0, 10.0); default 0
	
	char DEBLOCK_ALPHA;				// limited to (-6, 6); default 0
